luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxSmu_regdef.h
/** \brief  Recovery Timer Alarm Configuration */
typedef struct _Ifx_SMU_RTAC0_Bits
{
    Ifx_Strict_32Bit GID0:3;                /**< \brief [2:0] Group Index 0. (rw) */
    Ifx_Strict_32Bit ALID0:5;               /**< \brief [7:3] Alarm Identifier 0. (rw) */
    Ifx_Strict_32Bit GID1:3;                /**< \brief [10:8] Group Index 1. (rw) */
    Ifx_Strict_32Bit ALID1:5;               /**< \brief [15:11] Alarm Identifier 1. (rw) */
    Ifx_Strict_32Bit GID2:3;                /**< \brief [18:16] Group Index 2. (rw) */
    Ifx_Strict_32Bit ALID2:5;               /**< \brief [23:19] Alarm Identifier 2. (rw) */
    Ifx_Strict_32Bit GID3:3;                /**< \brief [26:24] Group Index 3. (rw) */
    Ifx_Strict_32Bit ALID3:5;               /**< \brief [31:27] Alarm Identifier 3. (rw) */
} Ifx_SMU_RTAC0_Bits;

/** \brief  Recovery Timer Alarm Configuration */
typedef struct _Ifx_SMU_RTAC1_Bits
{
    Ifx_Strict_32Bit GID0:3;                /**< \brief [2:0] Group Index 0. (rw) */
    Ifx_Strict_32Bit ALID0:5;               /**< \brief [7:3] Alarm Identifier 0. (rw) */
    Ifx_Strict_32Bit GID1:3;                /**< \brief [10:8] Group Index 1. (rw) */
    Ifx_Strict_32Bit ALID1:5;               /**< \brief [15:11] Alarm Identifier 1. (rw) */
    Ifx_Strict_32Bit GID2:3;                /**< \brief [18:16] Group Index 2. (rw) */
    Ifx_Strict_32Bit ALID2:5;               /**< \brief [23:19] Alarm Identifier 2. (rw) */
    Ifx_Strict_32Bit GID3:3;                /**< \brief [26:24] Group Index 3. (rw) */
    Ifx_Strict_32Bit ALID3:5;               /**< \brief [31:27] Alarm Identifier 3. (rw) */
} Ifx_SMU_RTAC1_Bits;

/** \brief  Recovery Timer Configuration */
typedef struct _Ifx_SMU_RTC_Bits
{
    Ifx_Strict_32Bit RT0E:1;                /**< \brief [0:0] RT0 Enable Bit (rw) */
    Ifx_Strict_32Bit RT1E:1;                /**< \brief [1:1] RT1 Enable Bit (rw) */
    Ifx_Strict_32Bit reserved_2:6;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit RTD:24;                /**< \brief [31:8] Recovery Timer Duration (rw) */
} Ifx_SMU_RTC_Bits;

/** \brief  Status Register */
typedef struct _Ifx_SMU_STS_Bits
{
    Ifx_Strict_32Bit CMD:4;                 /**< \brief [3:0] Last command received (rwh) */
    Ifx_Strict_32Bit ARG:4;                 /**< \brief [7:4] Last command argument received (rwh) */
    Ifx_Strict_32Bit RES:1;                 /**< \brief [8:8] Result of last received command (rwh) */
    Ifx_Strict_32Bit ASCE:1;                /**< \brief [9:9] Alarm Status Clear Enable (rwh) */
    Ifx_Strict_32Bit FSP:2;                 /**< \brief [11:10] Fault Signaling Protocol status (rh) */
    Ifx_Strict_32Bit FSTS:1;                /**< \brief [12:12] Fault State Timing Status (rwh) */
    Ifx_Strict_32Bit reserved_13:3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit RTS0:1;                /**< \brief [16:16] Recovery Timer 0 Status (rwh) */
    Ifx_Strict_32Bit RTME0:1;               /**< \brief [17:17] Recovery Timer 0 Missed Event (rwh) */
    Ifx_Strict_32Bit RTS1:1;                /**< \brief [18:18] Recovery Timer 1 Status (rwh) */
    Ifx_Strict_32Bit RTME1:1;               /**< \brief [19:19] Recovery Timer 1 Missed Event (rwh) */
    Ifx_Strict_32Bit reserved_20:12;        /**< \brief \internal Reserved */
} Ifx_SMU_STS_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Smu_union
 * \{  */

/** \brief  SMU Access Enable Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SMU_ACCEN0_Bits B;                  /**< \brief Bitfield access */
} Ifx_SMU_ACCEN0;

/** \brief  SMU Access Enable Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SMU_ACCEN1_Bits B;                  /**< \brief Bitfield access */
} Ifx_SMU_ACCEN1;

/** \brief  Alarm Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SMU_AD_Bits B;                      /**< \brief Bitfield access */
} Ifx_SMU_AD;

/** \brief  Alarm and Fault Counter */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SMU_AFCNT_Bits B;                   /**< \brief Bitfield access */
} Ifx_SMU_AFCNT;

/** \brief  Alarm Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SMU_AG_Bits B;                      /**< \brief Bitfield access */
} Ifx_SMU_AG;

/** \brief  Alarm Global Configuration */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SMU_AGC_Bits B;                     /**< \brief Bitfield access */
} Ifx_SMU_AGC;

/** \brief  Alarm Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SMU_AGCF_Bits B;                    /**< \brief Bitfield access */
} Ifx_SMU_AGCF;

/** \brief  FSP Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SMU_AGFSP_Bits B;                   /**< \brief Bitfield access */
} Ifx_SMU_AGFSP;

/** \brief  Clock Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SMU_CLC_Bits B;                     /**< \brief Bitfield access */
} Ifx_SMU_CLC;

/** \brief  Command Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SMU_CMD_Bits B;                     /**< \brief Bitfield access */
} Ifx_SMU_CMD;

/** \brief  Debug Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_SMU_DBG_Bits B;                     /**< \brief Bitfield access */
} Ifx_SMU_DBG;

